docs: use Mermaid diagrams and math equations (#563)
